#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "e3d7307003c2ff32d9e1373938624458" -> "44ae9fbc68596650f6cab6a5a5d5db4d"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "b55493ad8482498cd57b63ee989e2b95" -> "67f73d32ec582fd0de09ab747923a9d9"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be created
  + resource "aws_s3_bucket_object" "add_tag_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "806f880ed361be827ec0ccf673cebfff"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/add_tag_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/add_tag_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "d6c5a5c5759a845b7cedf02761249070" -> "4e8e45011f00bfc5289e92fa01028943"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "9a030cbc5d3187e39b003fd7f2aabaf9" -> "1f7ad4e51382eacea942ef40754468a8"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "86376ed65e4772cec0ce8694af17da57" -> "d2d3bbe65e96988ee9cd13f9df17eea2"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "989d26a9c762ae67725f2da3aa5f93bb" -> "46cef16ad8cab21157ef87232d70fa79"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "1d436d6787cde496f3aa2be6ec5cec13" -> "259f19b12ce1407999eab8fb0f748645"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "6d7adfd7eb2bd3ac125b71e771c9db3c" -> "a81f63aa5e4ebf5d69d8fd3722c2d15a"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "97068fdd4005e4d6c95bb89c684da6fa" -> "82b1c07f049c09f8221ad167ed1aca87"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "3888241f70c5d2b5245bd906e0787d0f" -> "321eec47961394eb4c288fdb360ee3c0"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "aceebfdf40bafa8264f2e2d3f46a8575" -> "87e971d08e9821c082e9184bc34eded3"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "b306572900d203c95b162189053d694b" -> "523dcbfc731be6876bf88308e3125c39"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "39b748b49362e65b47f7aa3337e87f18" -> "ed7a43dbcb88efb66e1c376616fc5daf"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "23ba45bb0d3cd0c14bca50cc73c9163c" -> "fdf829b6e08bccb6573fb7c7399aae3f"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "a0aeeb9ac89f6d4edbca3ec1061c836d" -> "b5a075af4266880bd65b9031814d1c50"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "f0756313784d5e63215b122cdd795efa" -> "90fad235cbe0bcd56ef6dd58c605096f"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "5248eaabc37af3fd53e5b09bd7dad30b" -> "7abb954933152b21f7e20b3833902898"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c06cbd8bb27d928adaeb78a7542bcf0a" -> "eb7f6999bdaa55d6da67d70de040229a"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "f7b1ba80cc170b7262829f2af8bcdafe" -> "da656abfaf0a6962548f289c51791e27"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "22da3ed5064edfbc9ef0c6b6ffaf7e74" -> "a9e8783b9115551ddcc266045e50f76b"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "58462de39bd692ca8765ca9a129b8bd4" -> "6c84db296846a62e5272da4c083f7ae3"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "eadf60d5ee4262073c06cbdaf2ce1f42" -> "d93726dd1421d52349ba4e6771791904"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "84d083f2b0999c391b7df628a5ec36e2" -> "536d167f180a56211aef555f2cdf61b1"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "510fb40b6200816909009a8517b4ed85" -> "31b8d304b5ea61d4cf9f5a187a206111"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "6ab248cf39ea7512441273b842ecaf1f" -> "6078a396994846bf8806eb861d7c10a1"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "9a37ae7609fa8a805472b4f07d0fa2f1" -> "5a9c1cb3012be2b0570f7c33b5f3c270"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "95c467d1517cf63292fa04dc773f0d8f" -> "da80d51291fee40b814b8593de63b200"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be created
  + resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      + acl                    = "private"
      + bucket                 = "kpinetwork-backend"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "5a8d8af1f1a61bab4460f783b60fbc56"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambdas/demo/get_tags_by_company_handler.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "buckets/../../dist/get_tags_by_company_handler.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "d1045d8f6402d750613b9704f77391df" -> "b916604e797ca0e4db9edb82f1a8ad5f"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "7a0f6725a3e3ced8b805266dbc1d2575" -> "9eb704a27754f137cf9abc2b0e47864e"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "1e0bb79791f46adeccf05c4f65527a5e" -> "4c354216bb2a819c1c7d1ecc6f743ae1"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "5814eedded9fe655b60e6d58e8c31b97" -> "3bfb67b057f31c9d5de86903279d965b"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "b5b3c834dec9011b5eb6018af0b1b09b" -> "d8c6bdef5760726a0aefb1c7367cd560"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "39fd90b2905335812c3c98dffe2b870f" -> "98aef1d325a1d6e40da555b366d05f22"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "affdd8ab0d2eb1fdb0e3e7d29fb99593" -> "b937a428c3a7ae529c1b8d628074490e"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "d1a147fff0e4c1127595f020c1ee6069" -> "ba1a8e74ccdfc45e5963d13f6b388019"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "9fb6decb622c0f56e5301c64ba56e152" -> "7fd74c1b9ca03d7e4ded56c799dff603"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "927cb2352ebd796fb597b178dc197b68" -> "806b0285c1e45e331623077107a2791d"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "ef816ab7733ee155c0f58f8242ba8f52" -> "00728433bb588d8e3d8c57a6ed159708"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "MSHwkZl9+MRNjpqS2Mhiexw9kt7kXEY/G39IQu1v5xo=" -> "Em2sgwcoAWuTSoPWZuVQIFLBzxVwotPK4jCTUEGBsrw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "fsfLINYfGWfngVfi3UUKhs121EmNcD2AcFl2f3rUCyY=" -> "Cy3t6Dl0RpxK58Zj+XREMJ6JIfHA4r9RW0chFh2qkbM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be created
  + resource "aws_lambda_function" "add_tag_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_add_tag_lambda_function"
      + handler                        = "add_tag_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/add_tag_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "GyL3LThbQ6w8nMlwlnMBi8goSfO3fyH9tw1pxACb80k="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "EiJGirJmFr2+wtEcSzF6/MclnHlbnoxoFLerEp0D9V0=" -> "SAsGhW4F6wTij/hgbcMVT0AMcXeU+F2RItAk7K9JRnc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "PwNIzWD8sggGLSFSyAZ767MROB1XR2YlWMCsZM65MKE=" -> "GdX2VMH8SFq/IBh+a76PYfkRV7B8NYeoglnsm+IokcM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "OWas56QxAggrHI0sbKJ3k1lBmQYKSh+vzHPQm4yW6Rs=" -> "eyVdhdiyUdfHxdhd5fEiP6hrYJ+M0eZ32wZ3Bh+19mU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "KSP+RWS+UvxXzk+Fwa4zrc92EwfEa9NpNXibuaJbthk=" -> "N7dappjPnKgtBsCAfEx/9YNwi9O5N9Ed0Cad2KFLqnQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "3fJhm/ji9Q/VT126SEKt1I61mXxGlnn1tSOh1K1eNbw=" -> "UtAL5VCI2agGbabcdzpE5ARF6FfaShK0GBtw8bVbNGc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "JGkxAGocywI+vPrFRppaHmxM6FDGWT1AJgd6mYVzePw=" -> "5BHSK3uOozg7Cl2ioeSfOOWo4KlpcQ4gDAydxjt01pU="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "ovZzTt/RhHfCogIdi4SKLAX19kBpQGEAVq8/YfpHeBg=" -> "9/TweVhqTdTI5zNwJj5dYqwWfv+0UxlHOzCEow4YkNo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "ry5IZhvZQXlsJSOb+rVNPeJmfoagC68qe+iGx+h7+ck=" -> "2+Zvb0NilX4wyAQ9YDuB3nyNEl6WXeZO6hu+IA+GDRU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "BwEpx+NzFjQ05yRaudNnosF+Zp27iLrbUTvFNa2g2HY=" -> "rAACm3hwUX33qTNIRXWevsDvYKCUgs2UCVgGpEnWK+E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "wb5UPoMGzbBmEtFhlVFdgtrw81ObpG+zMLW6UjLsX44=" -> "M0bCqFXzZ8sA2qbM4a0lNPasFsLVCwh3WtLtl/U5C8g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "jkbjS3zP9yl8I9lVPjrKniqMXqmbmr7D7mMUr2xabKg=" -> "g17R4nJRYxc35VvOyjk0BjzILHEGlCKZqbeX0GJz5nQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "2dUxeSuC3HRd5ckJNOBJHmLxVfCuxqddavacHA/Yy08=" -> "vwFWtrWwUAEKRRrG5YBJZ/6ZAYiOcgT71BUj1b+MzO4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-14T15:00:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "C2zF2PDX6Gdbi6GzzrpaQWq9F9rbX7FYJUxXtmcfHGs=" -> "ZP4B1RCXBmP5VySpYRsG8JCrmKPGV6iz5ygFH9kpSa0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:23.086+0000" -> (known after apply)
      ~ source_code_hash               = "st6ZxvECvQ2utv5Ym+hqZmd5ydh/HDDR+0VTS01ZzVk=" -> "mhqjD6Gh4HzTkojVr8ak8XraQDeqcHj5CPp6//e2NGo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "agarURpwJ5k2XqADb2zGp1Svb1CUcnlXvEevh4lzq5M=" -> "wgm1yg2BU7evkDeoMLIS3gHEXvRTRWf/k1ivGXUfESw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "RdhngHElLOKzpEFlx/hto/gJ/6VXhlBLrUZvBIk1qVw=" -> "0NSbj7GgX7tS19112SYCYZZID60a/OOwrwbEk+G95u0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "4W43Fu7SEZzzoH+9gGfHejos6UT69raPGBVbicN4jiI=" -> "bpbkFheeh8cJG7fr/E+x1U65+TJcIg93qIMEj5Rhk4U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "O2NJo2BUVBOMMcKEsYG6ylKuUsj+YWPYOff38BdEwWY=" -> "2WT4skxtnYiAxqv0f+cShbZO/bLcC5x7rN2Gyrhak1o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "IUR2trABaJh8lZcWQI0tMhq5P0tgt5Wni3sH8PnqwsI=" -> "yMC9WHcHw5dQRD44PCAV05GaOZm6piyUMXIAwjaGW2s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "wsirE8StrIGEO00/oLiw0pHZpTew2LO4HvPOc1KzEUI=" -> "R5ygwPcRfHis58xQvvB1re5sncvjVXyXOotj5yFK2f0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "2dFBbw61xP8cr55rQ1tdXgKZV1mlW+TQa08rWUHekaQ=" -> "rIiCoi6yPxGwVPyU3ZpdVivegMebqpgFtsQ9Lpeyc4U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "jhVmgieH63sjb0Q+eIwSozxDMZGyBWKkcpzaLVgUy2s=" -> "2x11yWYaS182V7Ume0LUD4OTGXzb4vcPCG/yK0g60CE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "rfSETxWmIDCxE3Sz/yT21QGPIZnlhjQXX6GI/nP1dEA=" -> "jPuXUfw8gAl9MPGh2MDKTfHVLoQRYBtNODuuwajHazs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "QAL28N0rR8pAnoAB76hZzYjw7BhNSbW2UDRQauCQuUM=" -> "4JbtI5OKezQWWi8JuJbWN55nguFMWRaCyJoE4rxBRIo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "yL1o7Y+IUnHT8n9GHwKRJ029sG4FJuHLF8ISeXLz/lY=" -> "TQYEiE7ZREHBUy6/61UlbY4JXlySgViti93R2dAZCqk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be created
  + resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "demo_get_tags_by_company_lambda_function"
      + handler                        = "get_tags_by_company_handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:22",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "kpinetwork-backend"
      + s3_key                         = "lambdas/demo/get_tags_by_company_handler.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "EXVRn0hrHavnzYhtWIEchL9TjqhZi4aidr8qeBuTv9U="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 100
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_KEY"   = (sensitive)
              + "DB_HOST"      = (sensitive)
              + "DB_NAME"      = "demokpinetworkdb"
              + "DB_PASSWORD"  = (sensitive)
              + "DB_USERNAME"  = (sensitive)
              + "SECRET_KEY"   = (sensitive)
              + "USER_POOL_ID" = "us-west-2_usXw4S12D"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0bda66e4a9afc62a9",
            ]
          + subnet_ids         = [
              + "subnet-0264422b45299167e",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "UVQUWalksA8snMWPP2FsSL79LfGNvnlRXMzK/vT7B6g=" -> "zZU5e8SiHHNcxv/GxeCMhdM4ukTbOxfBBj3tIBzYyig="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-11T22:29:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "VoUwIMDWBHtANVZyFbrzuBCDBfVlWAZ1vF1CK37qsy4=" -> "qNbt06tJb6PKXH1ggMfoYc0Sz5xytDcAHo5nl7gurUE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "P+keut76Dp0S5kWaW1p6Iz12hm2PLL76zhifeN31TH8=" -> "YoT+r/C3Ro6LjzjOqKhflepeF8vdVjLRqfp/JRXSvaE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "QNNnoK51BPfY6JyD5N0qzcNt8I0nIi/FFBWUbtHDU9s=" -> "VUXQtHP0+1YWH0prAodVEkY6w43S79x4MCptKSUM/jk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "dHw5z7IDVnNO7/UyCpf0P/3j9QRvGwKznALj0kFqDBc=" -> "FK/ej8MNxSZ2dtu3F2YSZfgJSPpTQrMc6FH3jskeiTA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "YNWa76kJ9nR8/gCXgIHfhyCa1erdNrfm0AgLINnRLUM=" -> "SYeMs64ipRPUzDVzMXttCXMV8utslDMsKePevTS90Tg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "QM2rVbEUuCEL+fjQGrwXHKpkLZwK78RstWlLEKrcV2k=" -> "NFRgq4x9WsGB7NjQyHUeTDRFoYRcaVB+K1T/iLNxihs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "EJ9bT0pgeDx6T+PvjnVlrfPrdocgEZfOltgKMKENKb4=" -> "BfR9Wtp0QMlq7VHSZZLr1joeVIjZMd+8910DoZUMNkw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "WRDlzaQQbkncPCuEGuCZBfdI4ytbYQuXlThbYewRRHE=" -> "iFtQsq6IHaOvG2N8BgrTuX+GVV/9jThDDhAkbEy8mXQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-11T22:28:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "W8BDS1NQKBQbbQNaA90zpZc9O6HIZBA792czWdepkJE=" -> "u+A65mz7L1ZV2OUC2CFPvRwbUs80ibQVgoXKOEbEBMQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-11T22:27:35Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "ret4qs" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-11T22:27:32Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.logs.aws_cloudwatch_log_group.add_tag_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "add_tag_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_add_tag_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.logs.aws_cloudwatch_log_group.get_tags_by_company_lambda_function will be created
  + resource "aws_cloudwatch_log_group" "get_tags_by_company_lambda_function" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/demo_get_tags_by_company_lambda_function"
      + retention_in_days = 14
      + tags_all          = (known after apply)
    }

  # module.network.aws_api_gateway_integration.add_tag_integration will be created
  + resource "aws_api_gateway_integration" "add_tag_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "jp8jt7"
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_integration.get_tags_by_company_integration will be created
  + resource "aws_api_gateway_integration" "get_tags_by_company_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "kb7gblbu69"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.network.aws_api_gateway_method.add_tag_method will be created
  + resource "aws_api_gateway_method" "add_tag_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "jp8jt7"
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_method.get_tags_by_company_method will be created
  + resource "aws_api_gateway_method" "get_tags_by_company_method" {
      + api_key_required = false
      + authorization    = "CUSTOM"
      + authorizer_id    = "3y14fs"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "kb7gblbu69"
    }

  # module.network.aws_api_gateway_resource.tags_by_company will be created
  + resource "aws_api_gateway_resource" "tags_by_company" {
      + id          = (known after apply)
      + parent_id   = "hper4a"
      + path        = (known after apply)
      + path_part   = "tags"
      + rest_api_id = "kb7gblbu69"
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-11T22:29:18Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

  # module.policy.aws_iam_role.add_tag_lambda_exec_role will be created
  + resource "aws_iam_role" "add_tag_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_add_tag_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role.get_tags_by_company_lambda_exec_role will be created
  + resource "aws_iam_role" "get_tags_by_company_lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows Lambda Function to call AWS services on your behalf."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo_get_tags_by_company_lambda_exec_role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.policy.aws_iam_role_policy.add_tag_cognito_policy will be created
  + resource "aws_iam_role_policy" "add_tag_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_add_tag_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy.get_tags_by_company_cognito_policy will be created
  + resource "aws_iam_role_policy" "get_tags_by_company_cognito_policy" {
      + id     = (known after apply)
      + name   = "demo_get_tags_by_company_cognito_policy"
      + policy = (sensitive)
      + role   = (known after apply)
    }

  # module.policy.aws_iam_role_policy_attachment.add_tag_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "add_tag_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_add_tag_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.add_tag_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "add_tag_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_add_tag_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.get_tags_by_company_lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "get_tags_by_company_lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
      + role       = "demo_get_tags_by_company_lambda_exec_role"
    }

  # module.policy.aws_iam_role_policy_attachment.get_tags_by_company_lambda_vpc will be created
  + resource "aws_iam_role_policy_attachment" "get_tags_by_company_lambda_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::435552912911:policy/iam_policy_lambda_network_function"
      + role       = "demo_get_tags_by_company_lambda_exec_role"
    }

  # module.policy.aws_lambda_permission.apigw_add_tag_lambda will be created
  + resource "aws_lambda_permission" "apigw_add_tag_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_add_tag_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGatewayAddTag"
    }

  # module.policy.aws_lambda_permission.apigw_get_tags_by_company_lambda will be created
  + resource "aws_lambda_permission" "apigw_get_tags_by_company_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "demo_get_tags_by_company_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (sensitive)
      + statement_id  = "AllowExecutionFromAPIGatewayGetTagsByCompany"
    }

Plan: 22 to add, 77 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*